index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Aldric Giacomoni)"/>
<link rel="stylesheet" href="./reveal.js-3.8.0/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js-3.8.0/css/theme/solarized.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-orgda7c11e">
<h2 id="orgda7c11e">You're already doing TDD</h2>
</section>
</section>
<section>
<section id="slide-orge3129bf">
<h2 id="orge3129bf">Decision-making</h2>
</section>
</section>
<section>
<section id="slide-org4febd57">
<h2 id="org4febd57">Make better decisions</h2>
<div class="outline-text-2" id="text-org4febd57">
</div>
</section>
<section id="slide-org5226665">
<h3 id="org5226665">Years ago I wrote this</h3>
<div class="org-src-container">

<pre  class="src src-ruby"><code trim><span style="color: #597bc5;">def</span> <span style="color: #f9cf80;">same_modality?</span>(documents)&#57344;&#57345;&#57345;
  modalities = []&#57344;&#57345;&#57345;
  documents.each <span style="color: #597bc5;">do</span> |document|&#57344;&#57345;&#57345;
    <span style="color: #597bc5;">unless</span> modalities.include?(document.modality)&#57344;&#57345;&#57345;
      modalities &lt;&lt; document.modality&#57344;&#57345;&#57345;
    <span style="color: #597bc5;">end</span>&#57344;&#57345;&#57345;
  <span style="color: #597bc5;">end</span>&#57344;&#57345;&#57345;
  modalities.size == 1&#57344;&#57345;&#57345;
<span style="color: #597bc5;">end</span>
</code></pre>
</div>
</section>
<section id="slide-orgb955970">
<h3 id="orgb955970">A year and a half later, I changed it to this</h3>
<div class="org-src-container">

<pre  class="src src-ruby"><code trim>documents.map(&amp;<span style="color: #71b9f8;">:modality</span>).uniq.size == 1
</code></pre>
</div>
<aside class="notes">
<p>
Knowing the tools at hand allowed me to recognize the problem as one that an existing tool solved
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org81cb49c">
<h2 id="org81cb49c">Big decisions are combinations of small decisions</h2>
</section>
</section>
<section>
<section id="slide-org637f52e">
<h2 id="org637f52e">Cartesian method</h2>
<ol>
<li>Accept as true only what is indubitable.</li>
<li>Divide every question into manageable parts.</li>
<li>Begin with the simplest issues and ascend to the more complex.</li>
<li>Review frequently enough to retain the whole argument at once.</li>

</ol>
<aside class="notes">
<p>
His reductive method also impoverished these domains in important ways, for it tended to restrict geometry to the study of straight line segments, physics to the study of ambiguously constituted bits of matter in motion,
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org1752871">
<h2 id="org1752871">Fermi questions</h2>
<aside class="notes">
<p>
Fermi was present when the first atomic bomb was detonated. He let a few pieces of paper fall and, based on how far they traveled, estimated the force of the blast.
</p>

</aside>
</section>
<section id="slide-orgd558334">
<h3 id="orgd558334">How many piano tuners are there in Chicago?</h3>
</section>
<section id="slide-org5aadb73">
<h3 id="org5aadb73">Decompose</h3>
<ul>
<li>how many pianos?</li>
<li># pianos per tuner per day?</li>

</ul>
</section>
<section id="slide-org06b77c1">
<h3 id="org06b77c1">How many pianos?</h3>
<ul>
<li>how many people in Chicago?</li>
<li>how many people per household?</li>
<li>how many households have a piano that's regularly tuned?</li>

</ul>
</section>
<section id="slide-org215b72d">
<h3 id="org215b72d">how many pianos per tuner per day?</h3>
<ul>
<li>how many hours per tuning?</li>
<li>how many hours per tuner?</li>

</ul>
</section>
<section id="slide-org0b73412">
<h3 id="org0b73412">plug in some numbers</h3>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">variable</th>
<th scope="col" class="org-right">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">population</td>
<td class="org-right">9M</td>
</tr>

<tr>
<td class="org-left">people per household</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">houses w/ piano</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-left">hours per tuning</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">hours per tuner</td>
<td class="org-right">50 * 5 * 8</td>
</tr>
</tbody>
</table>
</section>
<section id="slide-org9ec9523">
<h3 id="org9ec9523">add some operators</h3>
<p>
9000000 / 2 / 20 / (50 * 5 * 8 / 2)
</p>

</section>
<section id="slide-orgc1bccd4">
<h3 id="orgc1bccd4">Boom</h3>
<p>
225
</p>
</section>
<section id="slide-orgc867ba3">
<h3 id="orgc867ba3">Decompose</h3>
<p>
A big problem is a combination of small problems
</p>
</section>
</section>
<section>
<section id="slide-orgdda47e0">
<h2 id="orgdda47e0">-</h2>
</section>
</section>
</div>
</div>
<script src="./reveal.js-3.8.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js-3.8.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: './reveal.js-3.8.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js-3.8.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js-3.8.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: './reveal.js-3.8.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
